ode-bpel-soap/bpelContent/Search.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Search/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.wscomposition.org/Search/" name="Search">
    <types />
    <message name="SearchRequest">
        <part name="q" type="xsd:string" />
        <part name="num" type="xsd:int" />
    </message>
    <message name="SearchRequestResponse">
        <part name="SearchResponse" type="xsd:string" />
    </message>
    <portType name="Search">
        <operation name="SearchRequest" parameterOrder="q num">
            <input wsam:Action="http://www.wscomposition.org/Search/Search/SearchRequestRequest" message="tns:SearchRequest" />
            <output wsam:Action="http://www.wscomposition.org/Search/Search/SearchRequestResponse" message="tns:SearchRequestResponse" />
        </operation>
    </portType>
    <binding name="SearchSOAPBinding" type="tns:Search">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
        <operation name="SearchRequest">
            <soap:operation soapAction="" />
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Search/" />
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Search/" />
            </output>
        </operation>
    </binding>
    <service name="Search">
        <port name="SearchSOAP" binding="tns:SearchSOAPBinding">
            <soap:address location="http://localhost:9002/soapwrapper/Search" />
        </port>
    </service>
</definitions>